In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
names = ["Lolo","Lama","Lamees"]
index = [1,2,3]
b = pd.Series(names,index=index)
b

1      Lolo
2      Lama
3    Lamees
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [4]:
b.index = [11,12,13]
b

11      Lolo
12      Lama
13    Lamees
dtype: object

## Q3: Retrieve First and second elements.

In [6]:
print(b[11])
print(b[12])

Lolo
Lama

## Q4: Add duplicate elements, then remove the duplication

In [9]:
s = pd.Series({50: 'Lolo', 60: 'Nada'})
b = b.append(s)
b

C:\Users\lamaa\AppData\Local\Temp\ipykernel_13080\3004914189.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  b = b.append(s)

11      Lolo
12      Lama
13    Lamees
50     Ahmed
60      Nada
50      Lolo
60      Nada
dtype: object

In [12]:
b = b.drop_duplicates()
b

11      Lolo
12      Lama
13    Lamees
50     Ahmed
60      Nada
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [13]:
 data = {"id":[110,112,113],
            "name":["Fahad","Ali","Sara"]}
students = pd.DataFrame(data)
students

    id   name
0  110  Fahad
1  112    Ali
2  113   Sara

## Q6: Read educ_figdp_1_Data.csv file

In [17]:
df = pd.read_csv('educ_figdp_1_Data.csv')
df

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [19]:
#slice
p=df[11:20]
p

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
16,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
17,2005,European Union (27 countries),Total public expenditure on education as % of ...,4.92,e
18,2006,European Union (27 countries),Total public expenditure on education as % of ...,4.91,e
19,2007,European Union (27 countries),Total public expenditure on education as % of ...,4.93,e

In [20]:
#loc
k = df.loc[11:20]
k

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
16,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
17,2005,European Union (27 countries),Total public expenditure on education as % of ...,4.92,e
18,2006,European Union (27 countries),Total public expenditure on education as % of ...,4.91,e
19,2007,European Union (27 countries),Total public expenditure on education as % of ...,4.93,e
20,2008,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e

In [ ]:
# so the diff is in slice doesn`t include the 20 row but in loc does include 20 row :))))))))))))))))